/* -*- Mode: C; tab-width: 8; indent-tabs-mode: t; c-basic-offset: 8 -*- */
/*
 *  gcc-4.8 -m32 -S sample09.c -o sample09.s
 *
 *  $Id: sample09.c $
 *  $Lastupdate: 2020/06/08 14:14:01 $
 */
/*
 1234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890
 *--------+---------+---------+---------+---------X---------+---------+---------+---------+---------X
 */

// これはグローバル宣言
int globalVar;

void f(void)
{
	int b;
	int *ptr;

	ptr = &globalVar;
	*ptr = 100;
	b = *ptr;
}
